{
  "en_GB": {
    "About": "About me",
    "about-r0": "More than 25 years working as analyst programmer and team leader.",
    "about-r1": "From Borland Pascal to Java 17. From the very first time web enthusiast and FOSS addicted.",
    "about-r2": "I'm focused on Business to business processes and backend services since the last 13 years.",

    "Experience": "Experience",

    "experience-0-where": "Immobiliare.it SPA",
    "experience-0-period": "March 2009 - Present",
    "experience-0-role": "Project Leader",
    "experience-0-r0": "I am working on 3rd parties data integration and middleware applications in pure Java (version from 8 to 17), Java with Spring Boot, Python, PHP, Bash, SQL and XML/XSL. Project leader for 5 years on a 10 members team.",
    "experience-0-r1": "We have also a full customized web control panel to monitor the integrations status. It's a Spring Boot application with Thymeleaf templates, Bootstrap and JS/VueJS automation features.",
    "experience-0-r2": "We write REST/SOAP services too (such as for real time listings integration). I have been using MySQL as relational Database and Couchbase as NoSQL DB, RabbitMQ as message exchange system in microservices environment or asyncronous processing. And Rundeck as crontab alternative.",
    "experience-0-r3": "I am using Gitlab as project versioning and Continuous Integration system (with Ansible), Grafana for metrics, Atlassian Jira/Confluence as workflow and issues managing.",

    "experience-1-where": "Altervista.org",
    "experience-1-period": "March 2006 - March 2009",
    "experience-1-role": "Senior Developer",
    "experience-1-r0": "I wrote PHP and Perl processes. Altervista provides web space with PHP supingingport for free, with or without premium services.",
    "experience-1-r1": "I realized the first pioneeristic version of the self-installing site system. We supported Wordpress, Drupal, PHPForum and a gallery engine. In these years there were no Docker or Ansible, so we collected fresh installed images, unzipped them and injected user data and autogenerated unique keys, where necessary, using a Perl post-install script.",

    "experience-2-where": "Fondiaria SAI Insurances",
    "experience-2-period": "November 2003 - February 2006",
    "experience-2-role": "Freelance Senior Developer",
    "experience-2-r0": "I used Java with Struts and Tomcat with Oracle DB to release public and internal sites.",

    "experience-3-where": "Universi di Carta",
    "experience-3-period": "April 2003 - June 2009",
    "experience-3-role": "Shop Owner",
    "experience-3-r0": "I launched a Comics shop with a partner. After the startup phase I went back to my programmer's work.",
    "experience-3-r1": "I realized the shop site using Post-Nuke CMS.",

    "experience-4-where": "Vitaminic SPA",
    "experience-4-period": "February 2000 - March 2003",
    "experience-4-role": "Senior Developer",
    "experience-4-r0": "Vitaminic was selling digital music before iTunes. I started here as Junior PHP Programmer but I grew pretty soon and became the mainteiner of the cart system and the payment gate.",
    "experience-4-r1": "For the first time I used a FOSS only development toolkit with a LAMP production context.",

    "experience-5-where": "Valtur SPA",
    "experience-5-period": "1998 - January 2000",
    "experience-5-role": "Freelance Developer",
    "experience-5-r0": "I realized the cashless payment system used on Valtur's holiday villages. It was a set of client/server applications written on Borland Delphi with a MS SQLServer DB connected to RS-485's readers and printers. Using RfID tags was a pretty original payment method, in these years. First experience as team leader.",

    "Education": "Education",

    "education-0-where": "ENAIP - Turin (IT)",
    "education-0-period": "1993 - 1994",
    "education-0-target": "C, COBOL and Clipper professional course",

    "education-1-where": "ITIS Giuseppe Peano - Turin (IT)",
    "education-1-period": "1988 - 1993",
    "education-1-target": "IT oriented High School",

    "Skills": "Skills",
    "skills-hint": "&nbsp;move the mouse over the icons)",

    "topic-0": "Programming languages & Metalanguages",
    "topic-1": "OS, IDE & Tools",
    "topic-2": "Speaking languages",

    "Interests": "Life & Interests",

    "interests-r0": "I'm married from 2009, we live in Rome with three cats and two hamsters.",
    "interests-r1": "I'm proud to define myself as a nerd. I'm in love with Sci-fi. Bookworm, gamer, movies and series lover. Last but not least I'm a maker. I'm an hiker and I wrote some sci-fi books published with Delos Digital. I dream to write a Comics screenplay.",
    "interests-r2": "As visual arts addicted I like to keep clean my UI and output (both on CLI and Web) and my code.",

    "Proof of work": "Proof of work",

    "proof-r0": "This resume is a proof of work based on <a href=\"https://startbootstrap.com/theme/resume\">this theme</a>. Some pure Javascript functions hide my phone number and email address to robots (a weak protection, but they have to run javascript to find them).",
    "proof-r1": "A basical VueJS script switches from english to italian languages (using a not canonical gettext plugin).",
    "proof-r2": "All icons are from the Fontawesome free library, flags included. My photo is not cropped but I pan it using CSS.",
    "proof-r3": "Finally, I wrote a <a href=\"https://github.com/alienhunter3010/alienhunter3010.nodejs\">NodeJS project</a> to assemble third parties libraries. But github.io supports static pages only, so I have staticize all using <a href=\"https://github.com/brewingcode/pug-pack\">pug-pack</a>. You don't have to look for NodeJS in my skill, I have never used it before."
  },
  "it_IT": {
    "About": "Chi sono",
    "about-r0": "Oltre 25 anni come analista programmatore e team leader.",
    "about-r1": "Ho iniziato con Borland Pascal per arrivare a Java 17. Tra i primi a navigare e a programmare per il web, convinto sostenitore del FOSS.",
    "about-r2": "Da 13 anni lavoro su processi batch e servizi di backend Business to business.",

    "Experience": "Esperienza",

    "experience-0-where": "Immobiliare.it SPA",
    "experience-0-period": "Marzo 2009 - Oggi",
    "experience-0-role": "Project Leader",
    "experience-0-r0": "Lavoro sull'integrazione dati da parte di terze parti e su applicazioni middleware scritte in Java puro (versioni da 8 a 17), con l'ausilio di Spring Boot, Python, PHP, Bash, SQL e XML/XSL. Project leader da 5 anni in un team di 10 persone.",
    "experience-0-r1": "Abbiamo anche sviluppato un pannello di controllo per monitorare lo stato delle integrazioni. Si tratta di una Spring Boot application che usa Thymeleaf come template engine, Bootstrap e JS/VueJS per le funzionalità lato client.",
    "experience-0-r2": "Abbiamo sviluppato un certo numero di servizi REST/SOAP (volti per esempio all'integrazione di annunci in tempo reale). Usiamo MySQL come Database relazionale e Couchbase quando sono preferibili basi dati NoSQL, RabbitMQ per lo scambio di messaggi in contesti di microservizi o di processamento asincrono. Infine Rundeck come alternativa, non esclusiva, a crontab.",
    "experience-0-r3": "Utilizziamo Gitlab per tracciare i rilasci e per le funzionalità di Continuous Integration (con Ansible), Grafana per le metriche, Atlassian Jira/Confluence per la gestione dei problemi e l'organizzazione del lavoro.",

    "experience-1-where": "Altervista.org",
    "experience-1-period": "Marzo 2006 - Marzo 2009",
    "experience-1-role": "Senior Developer",
    "experience-1-r0": "Sviluppatore PHP e Perl. Altervista fornisce spazio web gratuito completo di supporto PHP e limitato spazio di DB, con o senza servizi premium.",
    "experience-1-r1": "Ho realizzato una pionieristica versione per installare automaticamente le più comuni piattaforme PHP dell'epoca. Supportavamo Wordpress, Drupal, PHPForum e alcune gallerie di immagini. In quegli anni non erano disponibili Docker o Ansible, per cui preparavamo delle installazioni vergini da scompattare e personalizzare con i dati degli utenti e generando al volo le chiavi univoche usando un script Perl di post-installazione.",

    "experience-2-where": "Fondiaria SAI Assicurazioni",
    "experience-2-period": "Novembre 2003 - Febbraio 2006",
    "experience-2-role": "Freelance Senior Developer",
    "experience-2-r0": "Sviluppavo in Java con Struts, Tomcat e DB Oracle per la creazione di siti istituzionali e di uso interno.",

    "experience-3-where": "Universi di Carta",
    "experience-3-period": "Aprile 2003 - Giugno 2009",
    "experience-3-role": "Socio di attività commerciale",
    "experience-3-r0": "Ho lanciato un negozio di fumetti con un socio. Dopo la fase di startup sono tornato alla mia carriera da programmatore.",
    "experience-3-r1": "Ho realizzato il sito del negozio basato sul CMS Post-Nuke.",

    "experience-4-where": "Vitaminic SPA",
    "experience-4-period": "Febbraio 2000 - Marzo 2003",
    "experience-4-role": "Senior Developer",
    "experience-4-r0": "Vitaminic vendeva musica digitale prima di iTunes. Ho iniziato come programmatore PHP Junior ma sono cresciuto in fretta fino a diventare responsabile dello sviluppo del carrello e del sistema di pagamento.",
    "experience-4-r1": "Per la prima volta ho usato lavorativamente una catena completamente FOSS di strumenti di sviluppo e un contesto di produzione LAMP.",

    "experience-5-where": "Valtur SPA",
    "experience-5-period": "1998 - Gennaio 2000",
    "experience-5-role": "Sviluppatore Freelance",
    "experience-5-r0": "Ho realizzato il sistema di pagamento elettronico usato nei villaggi Valtur. Era costituito da una serie di applicazioni client/server scritte in Borland Delphi con un DB MS SQLServer interfacciate a lettori e stampanti RS-485. Utilizzavano la tecnologia RfID, all'epoca piuttosto originale come sistema di pagamento. Prima esperienza da team leader.",

    "Education": "Studi",

    "education-0-where": "ENAIP - Torino",
    "education-0-period": "1993 - 1994",
    "education-0-target": "Corso professionale di C, COBOL e Clipper",

    "education-1-where": "ITIS Giuseppe Peano - Torino",
    "education-1-period": "1988 - 1993",
    "education-1-target": "Scuola superiore con indirizzo informatica",

    "Skills": "Conoscenze",
    "skills-hint": "&nbsp;muovi il mouse sulle icone)",

    "topic-0": "Linguaggi e metalinguaggi di programmazione",
    "topic-1": "Sistemi operativi, IDE e strumenti",
    "topic-2": "Lingue parlate",

    "Interests": "Vita e interessi",

    "interests-r0": "Sono sposato dal 2009, viviamo a Roma con tre gatti e due criceti.",
    "interests-r1": "Mi definisco orgogliosamente Nerd. Adoro la fantascienza. Leggo di tutto, apprezzo videogiochi, film e serie. Ho un pallino da Maker. Mi piacciono le escursioni e scrivo racconti e romanzi di fantascienza, alcuni sono stati pubblicati da Delos Digital. Sogno di scrivere una sceneggiatura a fumetti.",
    "interests-r2": "Da amante dalle arti visuali curo e tengo pulite UI e output (sia sul web che in linea di comando) così come mantengo leggibile il mio codice.",

    "Proof of work": "Prova d'autore",

    "proof-r0": "Questa pagina è una prova d'autore, basata su <a href=\"https://startbootstrap.com/theme/resume\">questo tema</a>. Alcune funzioni <i>Javascript pure<\/i> nascondono il mio numero di telefono e il mio indirizzo email ai robot (una protezione debole, per trovarli però devono processare il codice Javascript).",
    "proof-r1": "Un piccolo script VueJS consente di passare dall'italiano all'inglese (uso un plugin ispirato a gettext).",
    "proof-r2": "Tutte le icone arrivano dalla libreria gratuita di Fontawesome, bandiere incluse. La mia photo non è ritagliata ma posizionata nel punto giusto da CSS.",
    "proof-r3": "Infine, ho scritto un <a href=\"https://github.com/alienhunter3010/alienhunter3010.nodejs\">progetto NodeJS</a> per assemblare le librerie Javascript di terze parti. Github.io supporta però solo pagine statiche, quindi esportato tutto con <a href=\"https://github.com/brewingcode/pug-pack\">pug-pack</a>. Non cercate NodeJS tra le mie conoscenze, non l'ho mai usato prima."
  }
}
